# Taps
tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Install Fish
brew 'fish'

# Install ZSH (Replaced with Fish)
#brew 'zsh'
#brew 'zsh-completions'

# Install Binaries
brew 'hub'
brew 'tree'
brew 'mas'
brew 'node'
brew 'wget'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'yarn'

# Apps
cask 'aerial'
cask 'alfred'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'phpstorm'
cask 'sequel-pro'
cask 'slack'
cask 'visual-studio-code'
cask 'transmit'
cask 'docker'
cask 'docker-toolbox'
cask 'vlc'
cask 'imageoptim'
cask 'figma'
cask 'franz'
cask 'nextcloud'
cask 'bartender'
cask 'postbox'
cask 'font-hack-nerd-font'

# Install Mac App Store apps
mas 'Amphetamine', id: 937984704
mas 'Affinity Designer', id: 824171161
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Magnet', id: 441258766
mas 'Tweetbot for Twitter', id: 557168941
