# Taps
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'
tap 'caskroom/cask'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install Binaries
brew 'hub'
brew 'tree'
brew 'mas'
brew 'node'
brew 'wget'
brew 'php71'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'yarn'

# Development
brew unlink php56
brew install php71

# Apps
cask 'aerial'
cask 'alfred'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'phpstorm'
cask 'sequel-pro'
cask 'slack'
cask 'sublime-text'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'imageoptim'
cask 'figma'
cask 'rambox'

# Install Mac App Store apps
mas 'Amphetamine', id: 937984704
mas 'Affinity Designer', id: 824171161
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Magnet', id: 441258766